Revit 2024 API
ParameterTypeId.RebarAlignmentOptions Property
 "Bar Alignment"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarAlignmentOptions { get; }
Visual Basic
Public Shared ReadOnly Property RebarAlignmentOptions As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarAlignmentOptions {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace